---
kind: type
id: T:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData
source: html/26acc393-12fd-3d27-ee25-f21c88341190.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData

Represents the analysis data for one network segment.

## Syntax (C#)
```csharp
public class MEPNetworkSegmentData : IDisposable
```